In [1]:
import os
os.chdir("E:\Abhishek\Personal\Python_coding")
#this is different from R in which we use the swtwd() command

In [2]:
os.getcwd()
#This is different from the R as there is getwd() and not getcwd

'E:\\Abhishek\\Personal\\Python_coding'

importing of library

In [4]:
import numpy as np
import pandas as pd 
import matplotlib as mat

In [5]:
csv_obj=pd.read_csv("Mtcars.csv",sep= ',')
#this is different in R as there is used read.csv and sepertor we are using sep

In [ ]:
csv_obj[['cyl','hp']]  #another way

In [ ]:
csv_obj.iloc[1:12,[2,4,7,9]] #here this is the preferable  way of calling the selected variables from the data frame

In [1]:
del csv_obj

NameError: name 'csv_obj' is not defined

In [6]:
excel_obj=pd.read_excel("DATASC1.xlsx")
#excel_obj
#this is different from the R where it is ues as read.xlsx()

In [8]:
#excel_obj

In [16]:
excel_obj.shape
#in R it is dim(data)

(32, 13)

In [34]:
excel_obj.columns
#in R colNames(data)

Index(['Date', 'Day', 'Location', 'Lemon', 'Orange', 'Temperature', 'Leaflets',
       'Price', 'Sales', 'Revenue', 'Unnamed: 10', 'Unnamed: 11',
       'Unnamed: 12'],
      dtype='object')

excel_obj.rows 
#it does not work as dataframe in python has no attribute as row or rownames
#in R we use the rowNames()

In [30]:
excel_obj.head(3)
# in R head(data , 3)

,Date,Day,Location,Lemon,Orange,Temperature,Leaflets,Price,Sales,Revenue,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,2016-07-01 00:00:00,Friday,Park,97.0,67.0,70,90.0,0.25,164,41.00,NaN,Friday,Friday
1,2016-07-02 00:00:00,Saturday,Park,98.0,67.0,72,90.0,0.25,165,41.25,NaN,NaN,NaN
2,2016-07-03 00:00:00,Sunday,Park,110.0,77.0,71,104.0,0.25,187,46.75,NaN,NaN,NaN

In [36]:
excel_obj.tail(4)

,Date,Day,Location,Lemon,Orange,Temperature,Leaflets,Price,Sales,Revenue,Unnamed: 10,Unnamed: 11,Unnamed: 12
28,2016-07-29 00:00:00,Friday,Park,100.000000,66.000000,81,95.0,0.35,166,58.10,NaN,NaN,NaN
29,2016-07-30 00:00:00,Saturday,Beach,88.000000,57.000000,82,81.0,0.35,145,50.75,NaN,NaN,NaN
30,2016-07-31 00:00:00,Sunday,Beach,76.000000,47.000000,82,68.0,0.35,123,43.05,NaN,NaN,NaN
31,31,NaN,NaN,116.580645,80.354839,84,NaN,NaN,6105,2138.00,NaN,NaN,NaN

In [63]:
excel_obj.iloc[:,3]
#in R data[1,]

0      97.000000
1      98.000000
2     110.000000
3     134.000000
4     159.000000
5     103.000000
6     143.000000
7     123.000000
8     134.000000
9     140.000000
10    162.000000
11    130.000000
12    109.000000
13    122.000000
14     98.000000
15     81.000000
16    115.000000
17    131.000000
18    122.000000
19     71.000000
20     83.000000
21    112.000000
22    120.000000
23    121.000000
24    156.000000
25    176.000000
26    104.000000
27     96.000000
28    100.000000
29     88.000000
30     76.000000
31    116.580645
Name: Lemon, dtype: float64

In [43]:
excel_obj.iloc[1,4]

67.0

In [46]:
excel_obj.iloc[1:4]
#it will work as the head in python

,Date,Day,Location,Lemon,Orange,Temperature,Leaflets,Price,Sales,Revenue,Unnamed: 10,Unnamed: 11,Unnamed: 12
1,2016-07-02 00:00:00,Saturday,Park,98.0,67.0,72,90.0,0.25,165,41.25,NaN,NaN,NaN
2,2016-07-03 00:00:00,Sunday,Park,110.0,77.0,71,104.0,0.25,187,46.75,NaN,NaN,NaN
3,2016-07-04 00:00:00,Monday,Beach,134.0,99.0,76,98.0,0.25,233,58.25,NaN,NaN,NaN

In [49]:
#get the first 4 clumns for the  10 rows 
excel_obj.iloc[:10,:4]
#in pyrhon :starts from start index as inclusive and end index as exclusive
in R botj are inclusive

         Day Location  Lemon
0     Friday     Park   97.0
1   Saturday     Park   98.0
2     Sunday     Park  110.0
3     Monday    Beach  134.0
4    Tuesday    Beach  159.0
5  Wednesday    Beach  103.0
6   Thursday    Beach  143.0
7     Friday    Beach  123.0
8   Saturday    Beach  134.0
9     Sunday    Beach  140.0

In [52]:
#how to select columns 3,6 from row 4,9
excel_obj.iloc[[4,9],[3,6]]
# in R you have to use the vector

   Lemon  Leaflets
4  159.0     135.0
9  140.0     131.0

In [71]:
excel_obj.iloc[:,3].unique()

array([ 97.        ,  98.        , 110.        , 134.        ,
       159.        , 103.        , 143.        , 123.        ,
       140.        , 162.        , 130.        , 109.        ,
       122.        ,  81.        , 115.        , 131.        ,
        71.        ,  83.        , 112.        , 120.        ,
       121.        , 156.        , 176.        , 104.        ,
        96.        , 100.        ,  88.        ,  76.        ,
       116.58064516])

In [78]:
excel_obj['Lemon'].nunique()
#it gives the count of the unique values in a columns

0      97.000000
1      98.000000
2     110.000000
3     134.000000
4     159.000000
5     103.000000
6     143.000000
7     123.000000
8     134.000000
9     140.000000
10    162.000000
11    130.000000
12    109.000000
13    122.000000
14     98.000000
15     81.000000
16    115.000000
17    131.000000
18    122.000000
19     71.000000
20     83.000000
21    112.000000
22    120.000000
23    121.000000
24    156.000000
25    176.000000
26    104.000000
27     96.000000
28    100.000000
29     88.000000
30     76.000000
31    116.580645
Name: Lemon, dtype: float64

In [81]:
excel_obj['Temperature'].value_counts()

82    7
81    4
84    3
80    3
78    3
77    3
83    2
70    2
76    1
75    1
74    1
72    1
71    1
Name: Temperature, dtype: int64

In [82]:
excel_obj['Temperature'].describe()

count    32.00000
mean     79.03125
std       4.13080
min      70.00000
25%      77.00000
50%      80.50000
75%      82.00000
max      84.00000
Name: Temperature, dtype: float64

In [83]:
# Assigning value to a variable
df=25

In [84]:
df

25

In [85]:
excel_obj['Temperature'].mean()

79.03125

In [86]:
excel_obj['Temperature'].mode()

0    82
dtype: int64

In [87]:
excel_obj['Temperature'].var()

17.063508064516128

In [88]:
excel_obj['Temperature'].std()

4.130799930342321

In [89]:
excel_obj['Temperature'].sum()

2529

In [95]:
# to write the data in csv 
excel_obj.to_csv("a.csv", index =True)

In [96]:
excel_obj.to_excel("b.xlsx", index =False)